In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_excel('./tsp_(중구, 24, 17-21).xlsx', sheet_name='k=2')
df

  cluster  number                                 tsp route  distance
0       A      12  1, 10, 8, 3, 7, 5, 4, 12, 9, 2, 11, 6, 1  7.062148
1       B      23                                       NaN       NaN

In [3]:
#n : cluster 내 대여소 갯수
for i in range(len(df)):
    n=df.iloc[i, 1]
    d=df.iloc[i, 3]
    if n>=10:
        비용1=(d/6.8)*1332.74 + 23013.75*4 + 51450000/(16.8*365*2)
        df.loc[i,'truck type']='2.5t'
        df.loc[i, 'cost']=비용1
    else: 
        비용2=(d/8.5)*1332.74 + 23013.75*4 + 18375000/(16.8*365*2)
        df.loc[i,'truck type']='1.0t'
        df.loc[i, 'cost']=비용2
df

,cluster,number,tsp route,distance,truck type,cost
0,A,12,"1, 10, 8, 3, 7, 5, 4, 12, 9, 2, 11, 6, 1",7.062148,2.5t,97634.324193
1,B,23,NaN,NaN,2.5t,NaN

In [4]:
#total distance
a=0
for i in range(len(df)):
    a+=df.loc[i, 'distance']
a

nan

In [5]:
#total cost
b=0
for i in range(len(df)):
    b+=df.loc[i, 'cost']
b

nan